#ifndef __ASYNCUSBAPI_H__
#define __ASYNCUSBAPI_H__

/******************************************************************************************
** 文件名:   ASYNCUSBAPI_H
×× 主要类:   AsyncUSBAPI
**
** Copyright (c) 中科虹霸有限公司
** 创建人:   刘中昌
** 日  期:   2013-12-20
** 修改人:
** 日  期:
** 描  述:  数据处理函数--根据USB 异步传输图像
 *×× 主要模块说明:
**
** 版  本:   1.0.0
** 备  注:
**
*****************************************************************************************/

#include "usbcommon.h"

/**********************************************************************************************************************************
*                        回调函数
*  函 数 名：IkImageLoadeCallbackFunc
*  功    能：图像取后回调函数
*  说    明：
*  参    数：
*             type :     回调类型 0:一幅图像，1: Error
*             buf :    要获取的图像数据
*			 length:   图像大小
*  返 回 值：错误描述, 异常返回
*********************************************************************************************************************************/
typedef  void  (* IkImageLoadeCallBackFunc)
(IN int                type,        //回调类型
 IN unsigned  char		*buf, 		// 图像数据
 IN int                length);

class AsyncUSBAPI
{
public:
    AsyncUSBAPI();
    ~AsyncUSBAPI();
    /**********************************************************************************************************************************
    *                        开始传输函数
    *  函 数 名：Open
    *  功    能：初始化USB的设备
    *  说    明：
    *  参    数：EndPointNum:端点号：高速设备有31个端点，15IN,15OUT；低速3个端点，1IN,1OUT；除了端点0可IN可OUT，其它只能是IN或者OUT
    *  返 回 值：错误描述, 异常返回
    *********************************************************************************************************************************/
    int Open(IN IkImageLoadeCallBackFunc callBack);


    /**********************************************************************************************************************************
    *                        关闭传输函数
    *  函 数 名：Close
    *  功    能：关闭USB的操作
    *  说    明：关闭USB、清理内存
    *  参    数： 无
    *  返 回 值：true 操作成功；false操作失败
    *********************************************************************************************************************************/
    void Close();

    /**********************************************************************************************************************************
    *                        发送命令函数
    *  函 数 名：SendCmd
    *  功    能：通过命令控制USB相关操作
    *  说    明：
    *  参    数：EndPointNum：端点值  cmd 命令
    *  返 回 值：0 操作成功；-1操作失败
    *********************************************************************************************************************************/
    int SendCmd(IN int EndPointNum, IN char *cmd);

};

#endif // ASYNCUSBAPI_H
