-- 为这个数据库增加生成uuid的功能
CREATE EXTENSION "uuid-ossp";

-- 生成uuid的示例
SELECT uuid_generate_v4();

-- 添加人员及特征的函数，参数为
-- _personMax：总共增加多少个人
-- _irisMax：每个人、每只眼增加多少个特征

-- 使用示例
-- 增加三个人，每个人每只眼睛（左眼及右眼）增加2个特征（特征是重复且固定的）
-- SELECT CreateData(3, 2);

--========================================================
-- 函数开始
CREATE OR REPLACE FUNCTION CreateData(_personMax integer, _irisMax integer)
RETURNS boolean AS
$BODY$
    DECLARE
    personCount integer;
    irisCount   integer;
    personUuid  varchar;
    personName  varchar;
    personSn    varchar;
    irisUuid    varchar;
    eye int; -- 1 means left eye; 2 means right eye
    begin
    --  循环变量赋初值
    personCount:=1;

    -- 人员循环体
    FOR personCount IN 1.._personMax LOOP
        personUuid := uuid_generate_v4();
        personName := 'Name'||personCount;
        personSn   := 'WorkSn'||personCount;
        -- 可作为输出
        -- RAISE NOTICE 'personUuid is %', personUuid;
        -- RAISE NOTICE 'personName is %', personName;

        -- 插入人员数据
        INSERT INTO person (personid, name, worksn, superid, sex, 
			departname, hasirisdata) 
                  VALUES (personUuid, personName, personSn, 0, '男', 
			'应用软件部', 0);
        -- 插入人员对应的特征数据，特征实际上是一样的数据，
        -- 是某个已注册人员的数据，重复，星亮的
        -- 左眼的
        irisCount := 1;
        eye := 1;
        FOR irisCount IN 1.._irisMax LOOP
            irisUuid := uuid_generate_v4();
            -- RAISE NOTICE 'irisUuid is %', irisUuid;
            INSERT INTO irisdatabase (irisdataid, personid, irisCode, eyeflag)
	           VALUES (irisUuid, personUuid, 
	           '\000\221\023" \205\205\005j\356QA\000\004\335YP\246\242\020\375\375|X\337\267\001\000\300\337_\302\225\312\000X{\307\204=3\202\310D[7\225\275\312*:\275\305GQ\224\246jy\024\004H\310\325kh\225\325j"\267\267hl\335\200\000j\177\277\222\200\222\373\375l\002\227\367l\030\020"\253\373h\335\316::\277\377}\025\224\242\353\2734 \000@Q\020\024\205\206\242jhX\226\267\3772\020\000\004Xy\377,X\327\247\021\000\310\337\377  =\177\312H\240\277\273DD\0119\374oJ\212\2677h\022\325\335\2547b\202\2029=\237\000\000\330\332o9%\356\337\205\200{j\315\327\267\002\000]\275\246\354\334\325\2445=k)-,\0203?/\257\253+yy\021\025\357\357\010\0319)yY\335\021\035\352h`hj\377\357\355\335\225\222\223\2632@I@@Ho\257\277\266\226\372\372\377\357\305\325QP\236\236\354H\210Y\025=\254\250\372x}\315\315\204\204\352\372P\304<LLU\307\205\204\206\2528\\\235\237\306v9IM\266\262\221\0053x\310\207\023\200\0000\247\317\333\362(hU\0257\256\257\330\024\204\305\317Y@\222\336\356WWXJ\312\372\215\215\273\224\214\014-\255\27559**\236\226\234\334<\221\001\014\276\375y\002\246\242Y\375\357\010P\307\247\000\000\332\337u  =\337J@\250\277\332D\0057512 77:,+3\263\362\322\304l\17733;\263\267\007#3\222\267\353\247\227\027\021\000\000\000\005732jH@\021=\377\377\335\025\000\020\022((\212\227\267nny\021\000\004\325Y\356~\321\000\000\234yX\206\246\000\031\377\275X\331\367\227\000\000\332\337\373\242(=\177Jh\277\277\226\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000@\377', 
	           eye);
        END LOOP; -- end of left eye irisdata
        
        -- 右眼的
        irisCount := 1;
        eye := 2;
        FOR irisCount IN 1.._irisMax LOOP
            irisUuid := uuid_generate_v4();
            -- RAISE NOTICE 'irisUuid is %', irisUuid;
            INSERT INTO irisdatabase (irisdataid, personid, irisCode, eyeflag)
	           VALUES (irisUuid, personUuid, 
	           '\000\221\023" \205\205\005j\356QA\000\004\335YP\246\242\020\375\375|X\337\267\001\000\300\337_\302\225\312\000X{\307\204=3\202\310D[7\225\275\312*:\275\305GQ\224\246jy\024\004H\310\325kh\225\325j"\267\267hl\335\200\000j\177\277\222\200\222\373\375l\002\227\367l\030\020"\253\373h\335\316::\277\377}\025\224\242\353\2734 \000@Q\020\024\205\206\242jhX\226\267\3772\020\000\004Xy\377,X\327\247\021\000\310\337\377  =\177\312H\240\277\273DD\0119\374oJ\212\2677h\022\325\335\2547b\202\2029=\237\000\000\330\332o9%\356\337\205\200{j\315\327\267\002\000]\275\246\354\334\325\2445=k)-,\0203?/\257\253+yy\021\025\357\357\010\0319)yY\335\021\035\352h`hj\377\357\355\335\225\222\223\2632@I@@Ho\257\277\266\226\372\372\377\357\305\325QP\236\236\354H\210Y\025=\254\250\372x}\315\315\204\204\352\372P\304<LLU\307\205\204\206\2528\\\235\237\306v9IM\266\262\221\0053x\310\207\023\200\0000\247\317\333\362(hU\0257\256\257\330\024\204\305\317Y@\222\336\356WWXJ\312\372\215\215\273\224\214\014-\255\27559**\236\226\234\334<\221\001\014\276\375y\002\246\242Y\375\357\010P\307\247\000\000\332\337u  =\337J@\250\277\332D\0057512 77:,+3\263\362\322\304l\17733;\263\267\007#3\222\267\353\247\227\027\021\000\000\000\005732jH@\021=\377\377\335\025\000\020\022((\212\227\267nny\021\000\004\325Y\356~\321\000\000\234yX\206\246\000\031\377\275X\331\367\227\000\000\332\337\373\242(=\177Jh\277\277\226\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000@\377', 
	           eye);
        END LOOP; -- end of left eye irisdata
        
    RAISE NOTICE 'Person now %', personCount;
    
    END LOOP; -- end of personLoop
    return true;
    end;
$BODY$
LANGUAGE 'plpgsql' VOLATILE
COST 100;
-- 函数结束
--========================================================

-- 使用示例
-- 增加一个人，这个人每只眼睛增加2个特征（特征是重复且固定的）
SELECT CreateData(1, 2);

