#ifndef __SYNCUSBAPI_H__
#define __SYNCUSBAPI_H__
/******************************************************************************************
** 文件名:   SYNCUSBAPI_H
×× 主要类:   SyncUSBAPI
**
** Copyright (c) 中科虹霸有限公司
** 创建人:   刘中昌
** 日  期:   2013-12-20
** 修改人:
** 日  期:
** 描  述:  数据处理函数--根据USB 同步传输图像
 *×× 主要模块说明:
**
** 版  本:   1.0.0
** 备  注:
**
*****************************************************************************************/
#include "usbcommon.h"
class SyncUSBAPI
{
public:
    SyncUSBAPI();
    ~SyncUSBAPI();
    /**********************************************************************************************************************************
    *                        开始传输函数
    *  函 数 名：Open
    *  功    能：打开设备
    *  说    明：
    *  参    数：
    *  返 回 值：错误描述, 异常返回
    *********************************************************************************************************************************/
    int Open();

    /**********************************************************************************************************************************
    *                        获取图像函数
    *  函 数 名：getCurImage
    *  功    能：获得当前图像
    *  说    明：未获得数据阻塞
    *  参    数：
    *  返 回 值：错误描述代码
    *********************************************************************************************************************************/
    int GetImage(OUT unsigned char * image,OUT unsigned int& length);


    /**********************************************************************************************************************************
    *                        关闭传输函数
    *  函 数 名：Close
    *  功    能：关闭USB的操作包括读取和写入
    *  说    明：关闭USB、清理内存
    *  参    数： 无
    *  返 回 值：
    *********************************************************************************************************************************/
    void Close();

    /**********************************************************************************************************************************
    *                        发送命令函数
    *  函 数 名：SendCmd
    *  功    能：通过命令控制USB相关操作
    *  说    明：
    *  参    数：EndPointNum：端点值  cmd 命令
    *  返 回 值：错误描述代码
    *********************************************************************************************************************************/
    int SendCmd(IN int EndPointNum, IN char *cmd);

    /**********************************************************************************************************************************
    *                        发送命令函数
    *  函 数 名：ＳendMinImageCmd
    *  功    能：获取小图
    *  说    明：
    *  参    数：cmd 为左右眼坐标等信息，
                leftImage ：左眼图像
                leftLen ：左眼图像大小
                rightImage ：右眼图像
                rightLen ：右眼图像大小
    *  返 回 值：错误描述代码
    *********************************************************************************************************************************/
    int GetPictureTaken(IN Command cmd, OUT unsigned char *leftImage, OUT  unsigned int &leftLen,
                         OUT unsigned char *rightImage, OUT unsigned int &rightLen);
};

#endif // __SYNCUSBAPI_H__
